<?php


	// footer
	$mentions = "Законные реквизиты";
	$cgv = "Общие условия продаж";
	$charte = "Качественный устав";
	$choix_navette	= "Выбор транспортa";
	$info = "Моя личная информация";
	$titre_trajet1 = "Мои пути";
	$changer_pass = "изменить пароль";
	$nouveau_pass = "Получать новоcти из пароля";
	$info_client = "Информация о клиенте";
	$presentation_tarifs = "Наши тарифы";
	$presentation_services = "Наш сepвиc";
	$presentation_partenaires = "Наши клиенты и партнеры";
	$fin_paiement = "Спасибо за ваше доверие";

	// title de la page html
	$titre_page_accueil 		= "Добро пожаловать на Alsace-navette.com | Alsace-navette.com";
	$titre_page_livreor 		= "Гостевая книга | Alsace-navette.com";
	$titre_page_contact 		= "Бланк контакта | Alsace-navette.com";
	$titre_page_res_recap 		= "Бронирование: сводка | Alsace-navette.com";
	$titre_page_client 			= "Отдел клиента | Alsace-navette.com";
	$titre_page_changer_pass 	= $changer_pass . " | Alsace-navette.com";
	$titre_page_nouveau_pass 	= $nouveau_pass . " | Alsace-navette.com";
	$titre_info					= $info . " | Alsace-navette.com";
	$titre_page_trajet			= $titre_trajet1 . " | Alsace-navette.com";
	$titre_fin_paiement			= $fin_paiement . " | Alsace-navette.com";
	$titre_mention				= $mentions . ' | Alsace-navette.com';
	$titre_cgv					= $cgv . ' | Alsace-navette.com';
	$titre_charte				= $charte . ' | Alsace-navette.com';
	$titre_choix_navette		= $choix_navette . ' | Alsace-navette.com';
	$titre_info_client			= $info_client . ' | Alsace-navette.com';
	$titre_tarifs				= $presentation_tarifs . ' | Alsace-navette.com';
	$titre_services				= $presentation_services . ' | Alsace-navette.com';
	$titre_partenaires			= $presentation_partenaires . ' | Alsace-navette.com';
	
	
	$changer_pass = "Получать новый пароль";
	$nos_partenaires = "Наши партнеры";
	$nos_clients = "Спасибо всем тем, кто нам оказывают доверие";
	
	
	// drapeaux
	$alt_drapeau = "Английский язык";
	$alt_aide = "Помощь";
	$alt_paypal = "Осуществите ваши платежи через PayPal: скорое, бесплатное и безопаснaя решение";
	$alt_print = "Напечатать";
	$alt_texte = "Изменять размер текста";
	
	
	$aeroport_str = "Аэропорт Страсбурга";
	$aeroport_baden = "Аэропорт Карлсруэ / Бaдeн-Бaдeн";
	$aeroport_bale = "Аэропорт  Баль / Muлуз";
	$aeroport_fkh = "Аэропорт фрaнkфурт Hahn";
	$aeroport_fkm = "Аэропорт Frankfort Main ";
	$aeroport_zurich = " Аэропорт  Zürich";
	$aeroport_stuttgart = "Aэропорт Штутгарта";
	
	$alt_reseau_aeroport = "Выбирать ваш аэропорт в зависимости от вашего направления";
	$alt_tourisme = "Посещать Эльзас иначе";
	$alt_office_tourisme = "Офис туризма Страсбурга";
	$alt_sncf = "Сepвиc поезда";
	$alt_lvc = "Транспортный сepвиc по запросу, вы позволяете  просто вести";
	$alt_conseil = "Информируйтесь о стране направления";
	$alt_canal_asso = "Ассоциативная жизнь в Эльзасе";
	
	
	$deja_client_question = "Вы  уже клиент ?";
	
	$attention_der_min = "Вы сделали заказ в последнюю минуту, поэтому он будет стоить ";
    $attention_der_min_fin = " € дополнительно.";
	$txt_der_min = "Вы осуществили бронирование последней минуты. Вы не оплачиваете незамедлительно, но как только ваш запрос обработают вручную. Вы получите очень скоро наш ответ.";
	
	// fil d'ariane
	$ariane_debut   		= "Вы здесь";
	$ariane_accueil 		= "Прием ";
	$ariane_reserver 		= "Бронирование";
	$ariane_livreor 		= "Гостевая книга";
	$ariane_liste_livreor 	= "Список посланий";
	$ariane_reservation_1 	= "Информация пути (этап 1 / 5)";
	$ariane_reservation_2 	= "Сводка (этап 4 / 5)";
	$page_precedent 		= "Предыдущая";
	$page_suivant 			= "Следующая";
	$ariane_contact 		= "Бланк контакта";
	$ariane_client 			= "Клиент";
	$ariane_authentification = "Соединение";
	$ariane_pass 			= "Пароль";
	$ariane_changement_pass = "Изменение пароля";
	$ariane_new_password 	= "Пароль, потерянный";
	$ariane_trajet			= "Мои пути";
	$ariane_visu_trajet		= "Визуализация путей";
	$ariane_reservation_navette = "Выбор транспортa (этап 3 / 5) ";
	$ariane_info_perso 		= "Моя личная информация";
	$ariane_modif_info_perso = "Изменение личной информации";
	$ariane_fin_reservation	= "Конец бронирования (этап 5 / 5)";
	$ariane_reservation_info_client = "Конфискация информации клиентa (этап 2 / 5)";
	
	
	// speedbar
	$speed_accueil  = "Прием";
	$speed_tarif    = "Списки & Тарифы";
	$speed_contact  = "Контакт";
	$speed_livre_or = "Гостевая книга";
	$speed_service  = "Сepвис";
	$speed_reserver = "Сохранять";
	$speed_partenaire = "Клиенты";
	$speed_news = "Новости";
	
	
	// livre d'or
	$intro_livreor 		= "Оказанная служба вам понравилось , тогда, оставьте комментарий";
	$pseudo_livreor 	= "Ваш логин";
	$message_livreor 	= "Ваше послание";
	$txt_captcha 		= "Вы должны переписать письма, которые вы видите в нижеследующем изображении, чтобы ваше послание было утверждено.<br/>Это изображение содержит 5 букв.";
	$nouveau_captcha 	= "Изменять изображение";
	$txt_nb_message 	= "Количество посланий";
	$livreor_par		= "Через";
	$livreor_le	 		= "С";
	$aucun_message 		= "Нет никакого послания!";
	$valide_livreor 	= "Ваше послание было добавлено";
	
	
	// erreur spry
	$spry_valeur_requise = "Потребованная ценa";
	$spry_format = "Ошибка формата";
	$spry_correspondance = "Цены не соответствуют";
	
	$btn_continuer = "Продолжать";
	$erreur_flash = "Содержание этой страницы требует более недавнюю версию Adobe Flash Player";
	$visiter_alsace = "Посещать Эльзас";
	$navette_vol = "Транспорт для полетов";
	$choix_aeroport = "Выбор аэропорта";
	$a_dest_de = "К";
	$en_prov_de = "Из ";
	$meilleurs_prix = "Лучшие цены от Страсбурга";
	$photos = "Фотографии";
	
	$hover_aide_fixe = "Час отправления, которые соответствуют полетом (см. \"Транспорт для полетов\")";
	$hover_aide = "Время отправления по желанию (за дополнительную ";
    $hover_aide_fin = " € или Karlsruhe если Bâle)";
	
	
	$explication_forfait_minimum = "Этот пакет является минимальной ценой, по которой Шаттлом безопасно покинуть";
	$remboursement_forfait = "Если другие люди присоединяются к вашему мащину , вы будете возмещены.";
	$label_chk_forfait_mini = "Я соглашаюсь оплатить минимальную оплату по счету";
	
	$cout_du_trajet = "Стоимость пути";
	
	$explication_nouveau_mot_de_passe = "Желаете ли Вы изменить ваш пароль? Вам достаточно информировать использованное в настояще время, затем новое.";
	$explication_mot_de_passe_perdu = "Забыли ли Вы или потеряли ваш пароль? Никакой паники, просто информируйте ваш адрес email, использованный, и вам будет послан один к этому адресу.";
	$explication_connexion = "Уже бронировали ли вы у нас?  Так да, вы можете иметь доступ к истории ваших заказов, вашей личной информации, <br/> <br/> Чтобы вас соединять, вам достаточно ввести ваш адрес email так же как ввести ваш пароль.";
	$explication_donnees_perso = "Здесь, вы можете изменить вашу личную информацию.";
	$explication_trajet = "Здесь, у вас есть история ваших путей.";
	
	
	// page de contact
	$txt_contact 		= "Чтобы с нами контактировать, несколько возможностей, но проверьте хорошо, что <сильный> вы не являешься </сильным> в одном из случаев следуя";
	$txt_raison_1 		= "Наша служба вам нравится, и вы желаете нас поблагодарить. В этом случае, <имеет короче = \"livreor.html\"> книгу отзывов </имеет> ";
	$txt_raison_2 		= "Вы хотите бронировать. Все заказы делаются он-лайн, мы этого не осуществляем по телефону. Тем не менее, если у вас есть затруднения в том, чтобы сохранять, если вы не имеете доступа к Интернету, вы можете с нами контактировать через нижеследующие средства";
	$txt_moyen_courrier = "Приходить в наших отделах: <strong> AFI Эльзас 19, улица Kун 67000 Страсбург ФРАНЦИЯ </strong>";
	$txt_moyen_tel 		= "По телефону, <strong> 03 88 22 22 71> </strong>, 9 ч 00 - 12 00 и 14 ч 00 - 18 00";
	$txt_moyen_port 	= "В случае крайней необходимости, <strong> 06 27 18 12 52> </strong>";
	$txt_moyen_mail 	= "email, по адресу <strong> <имеет href = \" mailto:info@alsace-navette.com\"> info@alsace-navette.com </имеет> </strong>";
	$txt_moyen_form 	= "Через нижеследующий бланк";
	$moyen_contact 		= "Чтобы с нами контактировать, у вас есть различные средства в Вашем распоряжении";
	$raison_contact 	= "Мотив";
	$raison_contact_0 	= "Справка";
	$raison_contact_1 	= "Техническая проблема";
	$raison_contact_2 	= "Партнерство";
	$contact_ok 		= "Ваше послание было послано";
	$contact_erreur 	= "Ошибка неожиданно появилась во время отправления вашего послания";
	
	// menu de droite
	$titre_tourisme   = "Туризм с  Alsace-navette";
	$contenu_tourisme = "Позвольте вести себя; заимствовать приведенные сети, чтобы посещать alsace";

	
	$deja_client    = "Если вы - <Strong> уже </strong> клиент, <a href=\"client/client.html\">щелкните здесь</a>";
	$alt_calendrier = "Календарь";
	$obligatoire    = "Обязательные поля";
	$obligatoire_2  = "меньше одно из обоих полей должно быть информированным";
	$btn_raz 		= "Стирать";
	$btn_envoyer	= "Посылать";
	$mail_invalide 	= "Адрес email, не действителен";
	$selectionner_date_depart = "Выберите первоначальный день";
	$selectionner_date_retour = "Выберите день по возвращению";
	
	$erreur_champ_vide 	= "Вы должны заполнить все поля!";
	$erreur_code 		= "кодекс проверки не правилен!";
	$txt_pas_ressource_aller  = "Он не имеет там к несчастью доступных возможностей во время вашего отправления";
	$txt_pas_ressource_retour = "доступных возможностей во время вашего возвращения";
	$txt_pas_ressource_a_r    = "К сожалению там нету  доступных возможностей, чтобы туда, и обратнно";
	$txt_pas_ressource_forfait = "Между тем, вы можете добавиться на вышеупомянутом столь доступном, уже существующем машине.";
	
	$deconnexion 	= "Отключение";
	$changer_pass 	= "Изменять пароль";
	$trajet			= "История путей";
	$changer_info_perso = "Изменять данные";
	$erreur_date	= "Дата по возвращению должна быть по минимуму на следующий день после отправления";
	$aller			= "туда";
	$retour			= "обратно";
	$mon_compte 	= "Мой счет";
	$pas_de_trajet  = "Нет пути, вас касающиеся";
	$choix_navette	= "Выбор транспорта";
	$txt_deja_client = "На виду у вашего адреса emailа, показалось, что вы уже разместили заказ у нас. Чтобы возмещать вашу информацию, <a href=\"client/client.html\">пожалуйста, соединитесь</a> с вашим адресом email и ваш пароль!";
	$sur_adresse_prise = "Мы не смогли локализовать адрес, предоставленный для взятия на дом: ";
	$sur_adresse_depose = "Мы не смогли локализовать адрес, предоставленный для снятия на дом: ";
	$sur_adresse = "Мой адрес правилен";
	
	// trajet
	$legend_trajet       = "Ваше путешествие";
	$trajet_type         = "Тип поездки";
	$trajet_aller_simple = "идти просто";
	$trajet_aller_retour = "туда и Обратно";
	$trajet_depart       = "отъезд";
	$trajet_arrive       = "Направление";
	$date				 = "Дата";
	$heure				 = "Час";
	$date_depart         = "Дата отъезда";
	$date_retour         = "Дата по возвращению";
	$heure_depart		 = "Списки по запросу";
	$heure_retour		 = "Списки по запросу";
	$passager_adulte	 = "Взрослые";
	$passager_enfant	 = "Дети (<10 лет)";
	$legend_client	     = "Клиент";
	$civilite			 = "приветствовать";
	$nom_client		     = "Имя";
	$prenom_client	     = "Фамилия";
	$tel_client			= "Телефон";
	$port_client		= "Портативные";
	$eemail				= "почта";
	$adresse_client		= "Адрес";
	$code_post_client 	= "Почтовый Индекс";
	$ville_client		= "Город";
	$pays_client		= "Страна";
	$info_vol			=  "Информация о полет";
	$info_compl 		= "Особенные требования";
	$pt_rassemblement_aller 	= "Сборный пункт / Файлы<br />в Страсбурге(туда)";
	$pt_rassemblement_retour 	= "Сборный пункт / Файлы<br />в Страсбурге(oбpaтно)";
	$pt_rassemblement			= "Сборный пункт / Файлы<br />в Страсбурге";
	$txt_changer_info_perso = 'Чтобы изменять вашу личную информацию, щелкните <a href="client/info.html">здесь</а>';
	$depart_fixe 		=  "Намечено";
	$retour_fixe 		= "Намечено";
	$nb_pers_forfait_mini = "Количество лиц минимальной оплаты по счету";
	$enfant_g0 = "- 10 кг или-9 месяцев";
	$enfant_g1 = "9 - 18 кг или-4 года ";
	$enfant_g2 = "15 - 25 кг или-7 лет";
	$enfant_g3 = "22 - 36 кг или -10 лет";
	$provenance_vol = "Происхождение";
	$dest_vol = "Направление";
	$compagnie_vol = "Авиакомпания"; 
	$heure_vol = "Час полета";
	$nombre_passager = "Количество пассажиров";
	$mon_trajet = "Мой путь";
	$title_reservation = "Сводка вашего запроса(резервировать)";
	$btn_etape_suivante = "Следующий етап";
	$btn_derniere_etape = "ПОДТВЕРЖДАТЬ";
	
	// réservation
	$recapitulatif 	= "Сводка вашего запроса";
	$titre_trajet 	= " Ваш путь";
	$titre_client	= "Ваша информация";
	$info_incorrect = 'Если эта информация не правильна, щелкните <a href="reserver.html">здесь</a>';
	$btn_payer 		= "Оплачивать";
	$navette_existant_aller = "Уже eсть машины  предусмотренных чтобы поехать";
	$navette_existant_retour = "Уже eсть машины  предусмотренных чтобы возвращаться";
	$date_heure_navette 	= "Дата и час отправления";
	$nb_personne_navette 	= "Количество пассажиров<br />уже на трансрорте";
	$prix_navette 			= "Цена"; 
	$tarif 					= "Тарифы";
	$tarif_s				= "Тарифы";
	$cout_trajet_base 		= "Базовый тариф пути";
	$nb_passager 			= "Количество пассажиров";
	$prise_domicile			= "взять в дом";
	$depose_domicile		= "отвоз в дом";
	$res_der_minute_72		= "Бронирование менее, чем за 72 ч";
	$res_der_minute_24		= "Бронирование менее, чем за 24 ч"; 
	$prix_total				= "Oбщая Цена";
	$personne				= "человек";
	$forfait_mini			= "Минимальная оплата по счету";
	$fin_res				= 'Вы можете, обнаружuть детали вашего бронирования <a href="client/trajet.html">здесь</a> так же как информация о шофере, однажды это он будет приписан';
	$fin_res_accueil		= "Возвращаться в начало сайта";
	$navette_individuelle	= "Машина индивидуальная";
	$txt_oui				= "Да";
	$txt_non				= "Нет";
	$joindre				= "присоединять";
	
	/**
	 * Modif MARC
	 * 
	 * */			
	
	$titre_a_cocher_si_la_personne_est_autre = "If the passenger is not the person reserving the shuttle.";			
	$titre_autre_passager   = "( Passenger Information )";
	$nom_autre_passager     = "Last Name";
	$indicatif_tel_autre_passager    = "Phone code";
	$tel_port_autre_passager     = "Mobile number";
	
		
	// page client
	$deja_client_txt 	= "Уже клиент ?";
	$email 				= "Адрес почта";
	$passwd 			= "Пароль";
	$mdp_oublie 		= "Я забыл мой пароль...";
	$erreur_client_login = "K coжалению, mail / пароль , который вы дали, не существуйет!<br/><a href=\"client/password-a2.html\">Вы забыли ваш пароль?</a>";
	$erreur_client_inexistant = "Никакой клиент не был найден с предоставленным адресом";
	$valide_new_pass 	= "Новый пароль послан по предоставленному адресу";
	$object_new_pass 	= "Alsace-navette.com : Новый пароль";
	$erreur_envoie_mail = "Ошибка неожиданно появилась в течение отправления нового пароля. Этот не был изменен!";
	$debut_mail_pass 	= "Добрый день,<br/><br/>Вы попросили иметь новый пароль, такого рода: <strong> ";
	$fin_mail_pass 		= "</strong><br /><br />До скорого свидания на Alsace-navette.com";
	$ancien_mdp 		= "действительный пароль";
	$new_pass 			= "Новый пароль";
	$new_pass_confirm 	= "Подтверждать";
	$erreur_pass_correspondance = "Подтверждение нового пароля не прошло успещно!";
	$valide_new_passwd 	= "Ваш пароль успешно был измененен. <br/> Вам отправять через 3 секунды.";
	$debut_mail_passwd 	= "Добрый день,<br/><br/>Вы изменили ваш пароль, такого рода: <strong>";
	$erreur_ancien_pass = "Ваш бывший пароль не соответствует!";
	$valide_new_info 	= "Ваша личная информация была зарегистрирована успешно";
	
	

	
	// page des trajets
	$trajet_du = "Путь c";
	$table_mois = array("Январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь");
	$table_jour = array("В воскресенье", "понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота");
	$info_pratique = "Практическая информация";
	$chauffeur_nom = "Имя шофера";
	$chauffeur_prenom = "  Фймиля шофера";
	$chauffeur_mail = "Адрес mail шофера";
	$chauffeur_port = "Телефон шофера";
	$status_valide = "Утверждено нашим службoй";
	$status_invalide = "Не обработанный нашими службами";
    $statut_attente = "В ожидании подтверждения";

	$par_personne = "На человека";
	$aucune_navette = "В этот день нет еще предусмотренного машины  для вашего направления, но минимальная оплата по счету возможна";
	$navette_disponible = "Уже существуют машины: вы можете взять существующую, или попросить новость и следовательно согласиться оплатить минимальную оплату по счету! Для большей информации, репортера вы в <a href=\"tarifs.html\">страницу тарифов</a> ";
	
	
	$text_cgv = "<strong>Cond. 1 : Сервис </strong>
        <br />
    	Alsace navette аэропорт - служба, предложенная франко иранской ассоциацией Alsace , ее участникам. Тарифы следовательно включают ежегодный взнос ассоциации.
        
        <br /><br />
   		<strong>Cond. 2 : Бронирование </strong>
        <br />
    	Вы можете осуществить ваши он-лайн заказы минимум за  72 часа до даты отправления. mail  будет вам направлен тогда чтобы подтверждать ваш путь (дата, час, цена, наличность машины), который вы должны будете представить шоферу. Будьте добры хорошо проверять  фигурирующую информацию о mail подтверждениe.
        <br />
    	Если запрос бронирования сформулирован менее трех дней до даты отъезда, его должны обработаь  вручную по mail или по телефону с оператором. В случае наличности мест на попрошенном машине на счет в сервис выпишут 10 ";


    $text_cgv_1 = " € менее чем за 24 часов и";
    $text_cgv_2 = " € в течение 72 часов.
        <br />
    	По просьбе, вам сможет  быть послан  счет в формате PDF. 
        
        <br /><br />
    	<strong>Cond. 3 : Tуда / Обратно по адресу / бюро </strong>
        <br />
    	Расписания отправлений или приходов к адресу или к бюро делаются согласно планированию поездки. Подтвердите mail  и час перехода нашины.
        <br />
    	Служба  будет выписать в счет ";

        $text_cgv_3 = " € путем на Страсбурге и должен будет оплаченным по бронированию. По другим пунктам отправлений / приходов, попросить смету в рубрике \"особенные требования\".
        
        <br /><br />
    	<strong>Cond. 4 : Тарифы</strong>
        <br />
    	Тарифы  включают бронирование, доставку, взятие ответственности вашего багажа и вступления в ассоциацию.
        <br />
    	
        
        <br /><br />
    	<strong>Cond. 5 : Багаж ограничен чемоданом и ручным багажом пассажиром. Сверх того, выпишут стоюмостью 3 € на доплату  малышами и счет 5 € большим багажом. Это дополнение должно будет значить напрямую регулировать шоферу в течение взятия ответственности.</strong>
        <br />
    	Первоначально : Несмотря на все хлопоты, принесенные нашими службами, для того, чтобы обеспечивать вам удобную и приятную поездку,а возможно, чтобы причины независимые от нашего желания, смогли причинить задержку. В силу этого, мы вам напоминаем, что необходимо предусмотреть ваше прибытие в аэропорту по крайней мере за 3 часа до вашего взлета, чтобы помочь осуществить все формальности записи и погрузки. Мы вам рекомендуем также подписать страховой полис путешествий, так как, в случае задержки, мы отклоняем любые ответственные должности.
		<br/>
    	По прибытию : На любую задержку на погрузку на машине, предполагающем ожидание машину, вам выпишут счет 20 € за час. Дело должно будет следовать напрямую регулировать шоферу в течение взятия ответственности. Счет вам будет предоставлен, чтобы вы смогли его представить вашей авиакомпании или агенту страхового общества для выплаты.
        
        <br /><br />
        <strong>Cond. 6  Отсутствие :</strong>
        <br />
        В случае отсутствия пассажиров в указанном месте, предоставление останется выписанным в счет.
        
        <br /><br />
        <strong>Cond. 7 : Аннулирование</strong>
        <br />
        Бронирование окончательно и не дает права ни на какую выплату. Alsace navette оставляется для мотивированных аннулирований, осуществленных в более чем 10 дней до даты отъезда, предлагать коммерческий жест.
        
        <br /><br />
        <strong>Cond. 8 Животные :</strong>
        <br />
         Домашние животные маленького размера (вес ниже 6, кг) должны будут транспортироваться в корзину или закрытую сумку. Для высоких собак, они должны будут быть обузданными и не должны затруднять других пассажиров. На дополнение стоимостью 5 € животным выпишут счет и его должно быть на прямую  урегулированным шофером в течение взятия ответственности.
        
		<br /><br />
        <strong>Cond. 9 Ответственность : </strong>
        <br />
        Oтветственность экспедитора не может превзойти выплату оплаченной доставки.
        
        <br /><br />
        <strong>Cond. 10 : Выходные дни и уикенд </strong>
        <br />
        Aвтомобиль циркулирует уикенды и выходные дни.
        <br /><br /><br />
        <strong>В случае крайней необходимости, сообщите по телефону в 06 27 18 12 52</strong>";
		
	
	
	$text_mention = "<strong>- Настоящее место - собственность франко иранской Ассоциации Aльзаса </strong>
        <br />
    	<br />
        улица Кун19
        <br />
        Страсбург 67000 
        <br />
        N ° Серии 47767406300037
        <br />
        Кодекс NAF: 9499Z
        <br /><br />
        
        Номер транспортной лицензии людей :
        <br />
       Лицензия N°2007/42/0000784
        <br /><br />
        
        Имя сайта : <a href=\"www.alsace-navette.com\">www.alsace-navette.com</a>
        <br />
        <br />
        <strong>- Хостер caйта :</strong>
        <br />
        <br />
        1and1 Internet 
        <br />
         место  Gare 7
        <br />
        57200 Sarreguemines
        <br />
        Tel : 0825 080 020
        <br />
        Email : <a href=\"mail:support@1and1.fr\">support@1and1.fr</a>
        <br />
        
        <br />
        <strong>- Право обращения в данных:</strong>
        <br />
        <br />
        Вы располагаете правом обращения и правом исправления ваших личных данных.Для этого отправляянам  одну <a href=\"mailto:info@alsace-navette.com\">электронная почта</a>. Срок будет приблизительно один месяц.
        
        <br />
        <br />
        В случае крайней необходимости, звониите по телефону в 06 27 18 12 52";
		
	
	$text_charte = "Чтобы  предоставлять вам сepвис, качество которой безупречно, мы подчиняем компоненты в очень строгих правилах  в нашем качественной уставе. Эти правила присущи нашей структуре и доказывают нашим клиентам, путешественником, что мы придаем внимание к их благосостоянию.
		
       <br /><br />
       <strong>Устав 1 :Безопасность
       <br /><br />
       Устав 2 : Преуменьшать время ожидания :</strong>
       <br /><br />
       -  Мы вас предупреждаем наименьшую задержку c SMS.
       <br /><br />
       - Ожидание в месте назначения не должно превышать 15 минут.
       <br /><br />
       
       <strong>
       Устав 3 : Легкость доступа к серверу
       <br /><br />
       Устав 4 : Комфорт людей
       <br /><br />
       Устав 5 : Последоват за заказом
       <br /><br />
       Устав 6 : Доступный нашему  обществу
       <br /><br />
       Устав 7 : В слушании потребностей клиента 
       <br /><br />
       Устав 8 : Подразделение наших служащих
       <br /><br />
       Устав 9 : Наилучшее соотношение между качеством и ценой
       <br /><br />
       Устав 10 : Требования солидарного  и политэкономии раздела
       <br /><br />
       Устав 11 : Соблюдение среды
       <br /><br />
       Устав 12 : Ближайшая сервис
       <br /><br />
       Alsace Navette принимает участие в одном <a href=\"http://www.solidaire.alsace-navette.com\">проект раздела политэкономии и солидарный</a>.
		</strong>";
	

			$text_services = "<p><strong>Alsace-navette.com вам предлагает удобное и дружественное перемещение, подтвержденное индивидуальным качественным приемом.</strong>
	<br />
	<br />
	<br />
	Наши просторные и удобные транспортные средства располагаются 8 сидячими местами, кондиционированием воздуха, одним GPS.
	<br />
	<br />
	Мы обеспечиваем вашу транспортировку к крупным аэропортом в регионе.
	<br />
	<br />
	3 место встречи в Страсбурге, в наличии (обратите внимание, что оговорки не требуется) :
	
	<div>
		<ul>
			<li><a href=\"http://maps.google.fr/maps?f=q&amp;amp;hl=fr&amp;amp;q=rue+rene+cassin+strasbourg&amp;amp;sll=48.582933,7.743748&amp;amp;sspn=0.244834,0.752563&amp;amp;ie=UTF8&amp;amp;ll=48.598338,7.775552&amp;amp;spn=0.007649,0.023518&amp;amp;z=16&amp;amp;om=1\">Parking relais Palais des droits de l'homme</a></li>
			<li><a href=\"http://maps.google.fr/maps?f=l&amp;hl=fr&amp;q=hotel+hilton&amp;ie=UTF8&amp;near=Strasbourg&amp;ll=48.600112,7.745447&amp;spn=0.030594,0.09407&amp;z=14&amp;iwloc=A&amp;om=1\">Hôtel Hilton</a></li>
			<li><a href=\"http://maps.google.fr/maps?f=q&amp;hl=fr&amp;geocode=&amp;time=&amp;date=&amp;ttype=&amp;q=strasbourg+3+bld+Metz&amp;sll=48.582172,7.732444&amp;sspn=0.010164,0.020084&amp;ie=UTF8&amp;ll=48.583634,7.733924&amp;spn=0.010163,0.020084&amp;z=16&amp;iwloc=addr&amp;om=1\">Strasbourg Gare</a></li>
		</ul>
	</div>
	
	<br />
	<br />
	<div class=\"centre\">
		<p>
			Место встречи в aеpoпорте Базель / Мюлуз :
			<br />
			<br />
			<strong>Выход со стороны французского аеропорта</strong>
			<br />
			<img src=\"images/sortie_bale.jpg\" alt=\"aеpoпорт Базель / Мюлуз\" title=\"Базель Мюлуз аэропорт, Выход со стороны французского аеропорта.\" />
		</p>
	</div>
	
	<br />
	
	<br />
	
	<div class=\"centre\">
		<p>
			Место встречи в aеpoпорте Карлсруэ / Баден-Баден :
			<br />
			<br />
			<strong>Освобождение 4</strong>
			<br />
			<img src=\"images/sortie_bale.jpg\" alt=\"Выход аэропорт Баден-Баден Выход 4\" title=\"Выход аэропорт Баден-Баден Выход 4\" />
		</p>
	
	</div>
	
	<br />
	<br />
	
	<p>
	В аэропортах место для собраний находится на уровне прибытия и облицовочные выхода. В аэропорту во Франкфурте-Майне, Штутгарте и Цюрихе должны указат в заявке от терминала прибытия. В последнем случае в сообщение Вы указываете место встречи в пределах досягаемости
	<br />
	
	<br />
	
	Только перемещение клиентов, забронированныe их место обеспечена,наш транспорт  не обслуживает этого факта систематически все остановки.
	
	<br />
	<br />
	
	 Вас могут отвести также по вашему адресу или по бюро. На этот запрос вам выпишут счет:
	<br />
- на Страсбурге: 10 евро
<br />
- вне Страсбурга: попросить смету (выписка счета 1 € / в км начиная со Страсбурга Gare)

<br />
<br />

В случае крайней необходимости, сообщите по телефону в 06 27 18 12 52.
</p>
<br /><br /><br />
	</p>
";



	$text_tarifs = "
		<strong>Дополнительная информация :</strong>
		<br /><br />
	<ul>
		<li>Мы напоминаем, что Шаттлом Страсбург - Карлсруэ / Баден-Баден предоставляются из ";
    $text_tarifs_1 = " человек, или как минимум</li>
		<li>Мы напоминаем, что Шаттлом Страсбург - Базель Мюлуз осуществляется из ";
    $text_tarifs_2 = " человек, или как минимум</li>
		<li>Мы напоминаем, что Шаттлом Страсбург - Штутгарт и Страсбург - Цюрих осуществляется из ";
    $text_tarifs_3 = " человек, или как минимум</li>
		<li>Мы напоминаем, что Шаттлом Страсбург - Франкфурт-Хан, Страсбург - Франкфурт Главная осуществляются из ";
    $text_tarifs_4 = " человек или минимальных</li>
		<li>Стоимость проезда в оба действительны, если возврат происходит до 1 месяца после переезда. В противном случае, вы можете забронировать 2 в одну сторону</li>
		<li>Никакой дополнительной платы необходимо для Вашего багажа. Тем не менее, пассажиры должны быть ограничены одним чемодан и сумочку</li>
		<li>Вас могут отвести также по вашему адресу или по бюро. На этот запрос вам выпишут счет:
			<ul>
				<li> на Страсбурге: ";
    $text_tarifs_5 = " € евро</li>
				<li>вне Страсбурга: попросить смету (выписка счета ";
    $text_tarifs_6 = " € / в км начиная со Страсбурга Gare)</li>
			</ul>
		</li>
		<li>Оплату по счету стоимостью 5 евро попросят для животного</li>
		<li>По просьбе, вы можете , бронировать микроавтобус с шофером. Оплата по счету поднимает себе по 40 € за час аренды и 40 км. На дополнительный км выпишут счет на 1 €</li>
	</ul>
	<br />
	";
	
	
	$erreur_400 = "Провал анализа HTTP!";
	$erreur_401 = "Ошибка логин / пароль для доступа к администрации!";
	$erreur_403 = "Запрещенный запрос! !";
	$erreur_404 = "Попрошенная страница не существует !";
	$erreur_405 = "Метод не авторизованного запроса!";
	
	$erreur_500 = "Ошибка в сервере!";
	$erreur_501 = "Потребованные виды деятельности, не поддержанный сервером!!";
	$erreur_502 = "Не правильныя  ответ, посланный промежуточному серверу другим сервером !";
	$erreur_503 = "Служба не подлежащая использованию!";
	$erreur_504 = "Время ожидания ответа сервера прошедшему промежуточному серверу!!";
	$erreur_505 = "Версия HTTP, которой не управляет сервер!";
	
	$erreur_sql = "Ошибка cервера СКЛЬ неожиданно появилась !";
	
	$erreur_defaut = "Неизвестная ошибка  появилась неожиданно !";
	
	$page_erreur = "Ошибка неожиданно появилась";
	
	$revenir = "Предыдущая страница";
	
	$erreur = "Ошибка";
	
	
	
	// pour mail paypal
	
	$sujet_nouveau_client = "Добро пожаловать на Alsace-navette.com | установить вашу личность";
	$debut_nouveau_client = "добрый день, вы осуществили бронирование на Alsace-navette.com<br/><br/>Вы отныне наш клиент. Вы имеете следовательно доступ к настроенной информации о нашем сайте.<br/><br/>Чтобы иметь там доступ, вам нужен ваш адрес email: <strong>";
	$milieu_nouveau_client =  "</strong>и ваш пароль, который является: <strong>"; 
	$fin_nouveau_client = "</strong><br/><br/>В сайте, вы можете его изменить.<br/><br/>Чтобы вас соединить, встреча <a href=\"http://alsace-navette.com/aeroport/client/client.html\">на странице соединения</a>.<br/><br/>Спасибо за ваше доверие";
		
		
	$ajax_expli = "Следующие транспорты соответствуют точным транспорт.";  
	$ajax_depart = "Отправление в";
	
	
	$bonjour ="Добрый день";
	$demande_traite = "Ваш запрос в успешно было зарегистрировано для следующей пути: ";
	$fin_demande = "Вы получите в ближайшее время mail с последней информацией относительно вашего пути (имя водителя, его номер мобильного телефона). Вы можете обнаружить также в любое время эту информацию о <strong><a href=\"http://alsace-navette.com/aeroport\"> Эльзас-navette.com </a></strong> вас соединяя при помощи вашего электронного адреса и пароля, который вы получили электронной почтой в течение вашего первого бронирования.<br/><br/><br/>Спасибо за ваше доверие и до скорого свидания на Alsace-Navette.com";  
	$fin_demande_der_min = "Вы осуществили бронирование последней минуты, вы следовательно не оплатили, но как только ваш запрос обработают вручную. Вы получите очень скоро наш ответ. <br/> <br/> Вы можете обнаружить также в любое время эту информацию о <Strong> <a href=\"http://alsace-navette.com/aeroport\"> alsace-navette.com </a></strong> вас соединяя при помощи вашего электронного адреса и пароля, который вы получили электронной почтой в течение вашего первого бронирования.<br/><br/><br/> Спасибо за ваше доверие и до скорого свидания на Alsace-Navette.com";
	
	$titre_recap_mail_client = "Сводка вашего запроса";
	$meteo = "Погода ";
	
	$surcout_demande = "Транспорт по запросу";
	
	$expli_attendre = "Если вы предпочитаете подождать до других людей присоединиться к транспорту, вы не платите сейчас, но после того, как вы подтвердите транспорт.";
	$label_attendre = "Я жду других людей присоединились к моему транспорту";
	$mail_attendre = "<br /><br />Вы решили подождать, пока другие люди присоединиться к транспорту, чтобы подтвердить его. Когда другие пользователи будут присоединиться к Транспорту, вы будете уведомлены по почте.";
	$jai_attendu = "Вы предпочли бы подождать, пока другие пользователи  будут присоединиться к Транспорту. Вы сейчас ничего не платите, но после того, как вы подтвердите ваш Транспорт.";
	
	$choix = "Выбор ";
	
	$plan = "Смотри карту";
	
	$accept_cgv = "Я прочитал и принимаю <a href=\"conditions-generales-de-vente.html\" target=\"_blank\">главные условия продажи</a>";
	$erreur_accept_cgv = "Нужно принять <a href=\"conditions-generales-de-vente.html\" target=\"_blank\">главные условия продажи</a> !";
	
	
	$accept_forfait_mini_aller = "Я согласен платить минимальную цену<u>отъезд</u>";
	$accept_forfait_mini_retour = "Я согласен платить минимальную цену<u>вернуться</u>";
	$accept_forfait_mini_aller_retour = "Я согласен платить минимальную цену <u>ПОЕЗДКА ТУДА И НАЗАД</u>";
	
	$label_attendre_aller = "Я жду других людей присоединились к моему транспорту для<u>отъезда</u>";
	$label_attendre_retour = "Я жду других людей присоединились к моему транспорту для <u>вернуться</u>";
	
	$prix_a_payer = "Цену заплатить сейчас";
	
	$jai_attendu_aller = "Вы предпочли бы подождать, пока другие пользователи  будут присоединиться к вашему Транспорту<u>отъезд</u>. Вы не платите этот транспорт в настоящее время, но после того, как вы подтвердите ваш транспорт.Теперь, вы платите только за обратный рейс.";
	$jai_attendu_retour = "Вы предпочли бы подождать, пока другие пользователи  будут присоединиться к вашему Транспорту <u>le retour</u>. Вы не платите этот транспорт в настоящее время, но после того, как вы подтвердите ваш транспорт. Теперь, вы платите только отъезд.";
	
	$client_existe_pas = "Этот клиент не существует!";
	$code_incorect = "Проверка кода неправильно!" ;
	$res_pas_trouve = "Мы не могли найти соответствующую Бронирование !";
	$res_pas_au_client = "Эта Бронирование не соответствует этому клиенту!";
	$trajet_introuvable = "Путь не найден!";
	$ligne_introuvable_aller = "Бронирование за поездку в одну сторону не найдено!";
	$ligne_corr_trajet = "Бронирование не соответствует пути !";
	$ligne_retour_payer = "Эту поездку (назад) уже выплатили!";
	$ligne_aller_payer = "Эту поездку (в одну сторону) уже выплатили!";
	
	$ariane_paiement_manuel = "Отложенный платеж с оговоркой"; 
	$ariane_paiement_manuel_titre = $ariane_paiement_manuel . ' | Alsace-navette.com';
	
	$confirmation_resa = "Чтобы отправить нам свой запрос, нажмите на кнопку ниже";
	
	
	$horaire = "Списки";
	$dep_str = "Выезд Страсбург";
	$dep_aeroport = "Аэропорт вылета";
	
	$expli_hor_fixe = "В аэропортах ниже Существуют запланировано:";
	$expli_hor_demande = "Для аэропорты в Штутгарте, Франкфурте, Цюрихе и Хан часов бесплатно.<br />Для аэропортов, Карлсруэ-Баден и Базель-Мюлуз предлагается также график с просьбой дополнительно ";

    $mail_derniere_minute = "(Последняя минута)";


    $label_nouvelle_navette = "Я хочу новый челночный";
    $label_nouvelle_navette_aller_retour = "Я хочу новый челночный для <u>вернуться</u>";
    $label_nouvelle_navette_aller = "Я хочу новый челночный для <u>идти</u>";
    $label_nouvelle_navette_retour = "Я хочу новый челночный для <u>вернуться</u>";


    $warning_tel = "Если заполнить действительный номер телефона на свой страх и риск: в случае изменения в последнюю минуту, мы бы смогли прийти к вам!";


    $est_paye = "Платные";
    $non_paye = "Непогашенная";
    $sous_total = "Итого";


    $fin_demande2 = "Для челнока, когда вы решите подождать, вы будете уведомлены по почте в случае других людей присоединиться к челночной. Для поездок оплачены (если таковые имеются), вы будете получать по электронной почте с последней информацией о Вашей поездке (имя водителя, номер мобильного телефона). Вы также можете в любой момент найти эту информацию на <strong> <a href=\"http://alsace-navette.com/aeroport\"> Alsace-navette.com </a></strong> войти, используя Ваш адрес электронной почты и пароль, которые вы получили по электронной почте, когда ваш первый заказ. <br /><br /><br />Спасибо за ваше доверие и в скором времени Alsace-Navette.com";

    $pour_payer = "Чтобы заплатить, нажмите здесь :";

    $mode_de_paiement = "Метод оплаты";
    $erreur_paiement_ca = "Оплата ошибке | Alsace-navette.com";
    $ariane_erreur_paiement = "Оплата ошибке";
    $txt_erreur_ca_1 = "Ошибка при чтении параметров";
    $txt_erreur_ca_2 = "Ошибка выделения памяти. Не хватает памяти, доступной на сервере";
    $txt_erreur_ca_3 = "Ошибка при чтении параметров или QUERY_STRING CONTENT_LENGTH";
    $txt_erreur_ca_4 = "PBX_RETOUR, PBX_ANNULE, PBX_REFUSE или PBX_EFFECUTE слишком долго";
    $txt_erreur_ca_5 = "Ошибка при открытии файла (файл не найден или ошибка доступа)";
    $txt_erreur_ca_6 = "Ошибка формата файла (плохо обученных местных файл пуст или плохо отформатированную строку)";
    $txt_erreur_ca_7 = "Она не имеет обязательной переменной";
    $txt_erreur_ca_8 = "А цифровая переменная содержит нецифровые";
    $txt_erreur_ca_9 = "PBX_SITE содержит целый ряд сайтов, которые не содержат ровно 7 символов";
    $txt_erreur_ca_10 = "PBX_RANG содержит ряд рейтинга не совсем 2 символов";
    $txt_erreur_ca_11 = "PBX_TOTAL более чем на 10 или меньше, чем за 3 цифры";
    $txt_erreur_ca_12 = "PBX_LANGUE или PBX_DEVISE содержит код чья длина превышает 250 символов";
    $txt_erreur_ca_13 = "PBX_CMD пуст или содержит ссылки чья длина превышает 250 символов";
    $txt_erreur_ca_16 = "PBX_PORTEUR не содержат действительный адрес электронной почты";



    $intro_erreur_ca = "Произошла ошибка во время попытки оплаты";
    $fin_erreur_ca = "Произошла ошибка во время попытки оплаты";

    $info_mode_paiement = "Различные способы оплаты доступны совершенно безопасным.";

    $duree = "Время в пути ";
    $duree_s = "Путешествие раз ";
    $aeroport = "Аэропорт";

    $recherche_de_navette = "сть ли уже в автобусе?";
    $pas_de_navette = "Есть еще нет спроса на этот день для вашего назначения!";

    $statut = "статус";
    $en_attente_de_validation = "В ожидании одобрения";
    $confirmee = "Официально";
    $en_attente_de_paiement = "Ожидание оплаты";

    $indicatif = "УКАЗЫВАЮЩИЙ";
    $expli_indicatif = "<a href=\"http://fr.wikipedia.org/wiki/Liste_des_indicatifs_t%C3%A9l%C3%A9phoniques_internationaux_par_pays\" target=\"_blank\">Международный телефонный код</a> Ваш номер телефона мы отправим вам SMS с последней информацией о ваших Шаттлом.<br />В их число должно <strong><u>НЕ</u></strong> включить этот код.";

    $de = " из ";

    $btn_recherche = "Исследование";

    $alt_sondage = "опрос";

    $publie_le = "Опубликовано ";

    $lire_suite = "Читать дальше";

    $lien_sondage = "Чтобы помочь нам улучшить наши услуги, мы осуществили обзор, доступный <a href=\"http://alsace-navette.com/sondage/\">здесь</a>.";

    $je_suis_pro = "Обладая профессиональным, я хочу в конце этого месяца.";

    $lien = "ссылка";

    $voir_le_detail = "См. подробности";

    $fiche_partenaire = "Всего листов";

    $description = "Описание";

    $dans = "в";

    $choix_categorie = "Сортировка по категориям";

    $recapitulatif_pro = "Резюме, не оплачиваемых поездок";
    $titre_pro = "Отложенный платеж челночных (Professional)";

    $toutes_les_news = "Все новости";
?>
